In [5]:
import pandas
import pandas as pd
friendsnames=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\friendsnames.xlsx")
friendsnames

  friendsname  age  gender qualification
0    nasheena   25  female        degree
1     parveen   28  female        degree
2      anusha   28  female        degree
3    jayasree   25  female         btech
4      reshma   23  female        degree

In [15]:
import pandas
import pandas as pd
friendsnames=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\friendsnames.xlsx",sheet_name="Sheet2")
friendsnames

  friendsname  age gender qualification
0    snathosh   26   male        betech
1       khaja   23   male        degree
2       imran   23   male        degree

In [3]:
import pandas
import pandas as pd
friendsnames=pd.read_excel(r"C:\Users\HP\Documents\Shabana-pandas\friendsnames.xlsx",sheet_name="Sheet3")
friendsnames

  familuymembernames relations
0             mazeed    father
1        zahurunnisa    mother
2             safiya  daughter
3              siraj   brother
4            mobeena    sister
5            farjana    sister
6             saleem   brother

In [9]:
import pandas
import pandas as pd
friendsnames=pd.read_excel(r"C:\Users\HP\Documents\shabana_as8\friendsnames_quality.xlsx")
friendsnames

  friendsnames      quality
0      madhuri     innocent
1     shakeera       silent
2        bhanu  intilligent
3      jayasri       topper
4       anusha       silent
5      parveen     innocent
6       sushma        angry
7      sailaja       ranker
8      sirisha         lazy

In [11]:
import pandas
import pandas as pd
df=pd.read_excel(r"C:\Users\HP\Documents\shabana_as8\friendsnames_quality.xlsx")
df

  friendsnames      quality
0      madhuri     innocent
1     shakeera       silent
2        bhanu  intilligent
3      jayasri       topper
4       anusha       silent
5      parveen     innocent
6       sushma        angry
7      sailaja       ranker
8      sirisha         lazy

In [12]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [15]:
df.dtypes

friendsnames    object
quality         object
dtype: object

In [16]:
df.shape

(9, 2)

In [19]:
df.head()

  friendsnames      quality
0      madhuri     innocent
1     shakeera       silent
2        bhanu  intilligent
3      jayasri       topper
4       anusha       silent

In [20]:
df.tail()

  friendsnames   quality
4       anusha    silent
5      parveen  innocent
6       sushma     angry
7      sailaja    ranker
8      sirisha      lazy

In [21]:
df.head(n=3)

  friendsnames      quality
0      madhuri     innocent
1     shakeera       silent
2        bhanu  intilligent

In [22]:
df.tail(n=5)

  friendsnames   quality
4       anusha    silent
5      parveen  innocent
6       sushma     angry
7      sailaja    ranker
8      sirisha      lazy

In [2]:
import pandas
import pandas as pd
df=pd.read_excel(r"C:\Users\HP\Documents\shabana_as9\nonvegfood_items.xlsx")
df

      nonveg_items  taste
0  chicken biryani  spicy
1   mutton biryani  spicy
2     fish biryani  spicy

In [3]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [4]:
df.dtypes

nonveg_items    object
taste           object
dtype: object

In [5]:
df.head(n=2)

      nonveg_items  taste
0  chicken biryani  spicy
1   mutton biryani  spicy

In [6]:
df.tail

<bound method NDFrame.tail of       nonveg_items  taste
0  chicken biryani  spicy
1   mutton biryani  spicy
2     fish biryani  spicy>

In [8]:
df.columns

Index(['nonveg_items', 'taste'], dtype='object')

In [9]:
df.info

<bound method DataFrame.info of       nonveg_items  taste
0  chicken biryani  spicy
1   mutton biryani  spicy
2     fish biryani  spicy>

In [10]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.iloc[0:2,0:2]

      nonveg_items  taste
0  chicken biryani  spicy
1   mutton biryani  spicy

In [16]:
import pandas
import pandas as pd
df=pd.read_excel(r"C:\Users\HP\Documents\shabana_as9\vegfood_items.xlsx")
df

      vegfood_items   taste
0       potatochips  sality
1   panneer biryani   spicy
2  mashroom biryani  sality
3          babycorn  crispy

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
df.dtypes

vegfood_items    object
taste            object
dtype: object

In [19]:
df.shape

(4, 2)

In [20]:
df.head

<bound method NDFrame.head of       vegfood_items   taste
0       potatochips  sality
1   panneer biryani   spicy
2  mashroom biryani  sality
3          babycorn  crispy>

In [22]:
df.head(n=3)

      vegfood_items   taste
0       potatochips  sality
1   panneer biryani   spicy
2  mashroom biryani  sality

In [23]:
df.columns

Index(['vegfood_items', 'taste'], dtype='object')

In [24]:
df.info

<bound method DataFrame.info of       vegfood_items   taste
0       potatochips  sality
1   panneer biryani   spicy
2  mashroom biryani  sality
3          babycorn  crispy>

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
df.iloc[0:1,0:2]

  vegfood_items   taste
0   potatochips  sality